spec/fixtures/ups_json/rates_with_rate_modifiers.json

{
  "RateResponse": {
    "Response": {
      "ResponseStatus": {
        "Code": "1",
        "Description": "Success"
      },
      "Alert": [
        {
          "Code": "111730",
          "Description": "Invalid Date. Changed to today's date"
        },
        {
          "Code": "110971",
          "Description": "Your invoice may vary from the displayed reference rates"
        },
        {
          "Code": "112237",
          "Description": "Modifier is applied on Package(s);"
        }
      ],
      "TransactionReference": ""
    },
    "RatedShipment": [
      {
        "Service": {
          "Code": "13",
          "Description": ""
        },
        "RatedShipmentAlert": [
          {
            "Code": "111730",
            "Description": "Invalid Date. Changed the pickup date"
          },
          {
            "Code": "110971",
            "Description": "Your invoice may vary from the displayed reference rates"
          }
        ],
        "BillingWeight": {
          "UnitOfMeasurement": {
            "Code": "LBS",
            "Description": "Pounds"
          },
          "Weight": "10.0"
        },
        "TransportationCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "168.74"
        },
        "BaseServiceCharge": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "ItemizedCharges": {
          "Code": "270",
          "CurrencyCode": "USD",
          "MonetaryValue": "12.40"
        },
        "ServiceOptionsCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "TotalCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "168.74"
        },
        "GuaranteedDelivery": {
          "BusinessDaysInTransit": "1"
        },
        "RatedPackage": [
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "84.37"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "60.68"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "11.64"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "84.37"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          },
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "84.37"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "60.68"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "11.64"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "84.37"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          }
        ]
      },
      {
        "Service": {
          "Code": "01",
          "Description": ""
        },
        "RatedShipmentAlert": {
          "Code": "110971",
          "Description": "Your invoice may vary from the displayed reference rates"
        },
        "BillingWeight": {
          "UnitOfMeasurement": {
            "Code": "LBS",
            "Description": "Pounds"
          },
          "Weight": "10.0"
        },
        "TransportationCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "186.20"
        },
        "BaseServiceCharge": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "ItemizedCharges": {
          "Code": "270",
          "CurrencyCode": "USD",
          "MonetaryValue": "12.40"
        },
        "ServiceOptionsCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "TotalCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "186.20"
        },
        "GuaranteedDelivery": {
          "BusinessDaysInTransit": "1",
          "DeliveryByTime": "10:30 A.M."
        },
        "RatedPackage": [
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "93.10"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "68.21"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "12.84"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "93.10"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          },
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "93.10"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "68.21"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "12.84"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "93.10"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          }
        ]
      },
      {
        "Service": {
          "Code": "12",
          "Description": ""
        },
        "RatedShipmentAlert": {
          "Code": "110971",
          "Description": "Your invoice may vary from the displayed reference rates"
        },
        "BillingWeight": {
          "UnitOfMeasurement": {
            "Code": "LBS",
            "Description": "Pounds"
          },
          "Weight": "10.0"
        },
        "TransportationCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "82.04"
        },
        "BaseServiceCharge": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "ItemizedCharges": {
          "Code": "270",
          "CurrencyCode": "USD",
          "MonetaryValue": "12.40"
        },
        "ServiceOptionsCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "TotalCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "82.04"
        },
        "GuaranteedDelivery": {
          "BusinessDaysInTransit": "3"
        },
        "RatedPackage": [
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "41.02"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "23.31"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.66"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "41.02"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          },
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "41.02"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "23.31"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.66"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "41.02"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          }
        ]
      },
      {
        "Service": {
          "Code": "03",
          "Description": ""
        },
        "RatedShipmentAlert": [
          {
            "Code": "112237",
            "Description": "Destination Modifier is applied on Package 0"
          },
          {
            "Code": "112237",
            "Description": "Destination Modifier is applied on Package 1"
          },
          {
            "Code": "110971",
            "Description": "Your invoice may vary from the displayed reference rates"
          }
        ],
        "BillingWeight": {
          "UnitOfMeasurement": {
            "Code": "LBS",
            "Description": "Pounds"
          },
          "Weight": "10.0"
        },
        "TransportationCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "57.24"
        },
        "BaseServiceCharge": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "ItemizedCharges": {
          "Code": "270",
          "CurrencyCode": "USD",
          "MonetaryValue": "11.30"
        },
        "ServiceOptionsCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "TotalCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "57.24"
        },
        "RatedPackage": [
          {
            "RateModifier": {
              "ModifierType": "DTM",
              "ModifierDesc": "Destination Modifier",
              "Amount": "-0.60"
            },
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "28.62"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "13.95"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.70",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "3.92"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "28.62"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          },
          {
            "RateModifier": {
              "ModifierType": "DTM",
              "ModifierDesc": "Destination Modifier",
              "Amount": "-0.60"
            },
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "28.62"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "13.95"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.70",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "3.92"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "28.62"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          }
        ]
      },
      {
        "Service": {
          "Code": "14",
          "Description": ""
        },
        "RatedShipmentAlert": {
          "Code": "110971",
          "Description": "Your invoice may vary from the displayed reference rates"
        },
        "BillingWeight": {
          "UnitOfMeasurement": {
            "Code": "LBS",
            "Description": "Pounds"
          },
          "Weight": "10.0"
        },
        "TransportationCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "255.80"
        },
        "BaseServiceCharge": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "ItemizedCharges": {
          "Code": "270",
          "CurrencyCode": "USD",
          "MonetaryValue": "12.40"
        },
        "ServiceOptionsCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "TotalCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "255.80"
        },
        "GuaranteedDelivery": {
          "BusinessDaysInTransit": "1",
          "DeliveryByTime": "8:00 A.M."
        },
        "RatedPackage": [
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "127.90"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "98.21"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "17.64"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "127.90"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          },
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "127.90"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "98.21"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "17.64"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "127.90"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          }
        ]
      },
      {
        "Service": {
          "Code": "02",
          "Description": ""
        },
        "RatedShipmentAlert": {
          "Code": "110971",
          "Description": "Your invoice may vary from the displayed reference rates"
        },
        "BillingWeight": {
          "UnitOfMeasurement": {
            "Code": "LBS",
            "Description": "Pounds"
          },
          "Weight": "10.0"
        },
        "TransportationCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "94.82"
        },
        "BaseServiceCharge": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "ItemizedCharges": {
          "Code": "270",
          "CurrencyCode": "USD",
          "MonetaryValue": "12.40"
        },
        "ServiceOptionsCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "0.00"
        },
        "TotalCharges": {
          "CurrencyCode": "USD",
          "MonetaryValue": "94.82"
        },
        "GuaranteedDelivery": {
          "BusinessDaysInTransit": "2"
        },
        "RatedPackage": [
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "47.41"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "28.82"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "6.54"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "47.41"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          },
          {
            "TransportationCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "47.41"
            },
            "BaseServiceCharge": {
              "CurrencyCode": "USD",
              "MonetaryValue": "28.82"
            },
            "ServiceOptionsCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "0.00"
            },
            "ItemizedCharges": [
              {
                "Code": "376",
                "CurrencyCode": "USD",
                "MonetaryValue": "5.85",
                "SubType": "Rural"
              },
              {
                "Code": "400",
                "CurrencyCode": "USD",
                "MonetaryValue": "0.00",
                "SubType": "EVS"
              },
              {
                "Code": "375",
                "CurrencyCode": "USD",
                "MonetaryValue": "6.54"
              }
            ],
            "TotalCharges": {
              "CurrencyCode": "USD",
              "MonetaryValue": "47.41"
            },
            "Weight": "1.0",
            "BillingWeight": {
              "UnitOfMeasurement": {
                "Code": "LBS",
                "Description": "Pounds"
              },
              "Weight": "5.0"
            }
          }
        ]
      }
    ]
  }
}
